public/man/man1/git-apply.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-apply.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-apply.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-apply - Apply a patch to files and/or to the index</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git apply [--stat] [--numstat] [--summary] [--check] [--index | --intent-to-add] [--3way]
          [--apply] [--no-add] [--build-fake-ancestor=&lt;file&gt;] [-R | --reverse]
          [--allow-binary-replacement | --binary] [--reject] [-z]
          [-p&lt;n&gt;] [-C&lt;n&gt;] [--inaccurate-eof] [--recount] [--cached]
          [--ignore-space-change | --ignore-whitespace]
          [--whitespace=(nowarn|warn|fix|error|error-all)]
          [--exclude=&lt;path&gt;] [--include=&lt;path&gt;] [--directory=&lt;root&gt;]
          [--verbose | --quiet] [--unsafe-paths] [--allow-empty] [&lt;patch&gt;...]
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Reads the supplied diff output (i.e. &#34;a patch&#34;) and applies it to files.
When running from a subdirectory in a repository, patched paths outside
the directory are ignored. With the <strong>–index</strong> option, the patch is also
applied to the index, and with the <strong>–cached</strong> option, the patch is only
applied to the index. Without these options, the command applies the
patch only to files, and does not require them to be in a Git
repository.</p>
<p>
This command applies the patch but does not create a commit. Use
*git-am*(1) to create commits from patches generated by
*git-format-patch*(1) and/or received by email.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>&lt;patch&gt;…</p>
<blockquote>
<p>The files to read the patch from. <em>-</em> can be used to read from the
standard input.</p>
</blockquote>
<p>
–stat</p>
<blockquote>
<p>Instead of applying the patch, output diffstat for the input. Turns off
&#34;apply&#34;.</p>
</blockquote>
<p>
–numstat</p>
<blockquote>
<p>Similar to <strong>–stat</strong>, but shows the number of added and deleted lines in
decimal notation and the pathname without abbreviation, to make it more
machine friendly. For binary files, outputs two <strong>-</strong> instead of saying <strong>0
0</strong>. Turns off &#34;apply&#34;.</p>
</blockquote>
<p>
–summary</p>
<blockquote>
<p>Instead of applying the patch, output a condensed summary of information
obtained from git diff extended headers, such as creations, renames, and
mode changes. Turns off &#34;apply&#34;.</p>
</blockquote>
<p>
–check</p>
<blockquote>
<p>Instead of applying the patch, see if the patch is applicable to the
current working tree and/or the index file and detects errors. Turns off
&#34;apply&#34;.</p>
</blockquote>
<p>
–index</p>
<blockquote>
<p>Apply the patch to both the index and the working tree (or merely check
that it would apply cleanly to both if <strong>–check</strong> is in effect). Note
that <strong>–index</strong> expects index entries and working tree copies for
relevant paths to be identical (their contents and metadata such as file
mode must match), and will raise an error if they are not, even if the
patch would apply cleanly to both the index and the working tree in
isolation.</p>
</blockquote>
<p>
–cached</p>
<blockquote>
<p>Apply the patch to just the index, without touching the working tree. If
<strong>–check</strong> is in effect, merely check that it would apply cleanly to the
index entry.</p>
</blockquote>
<p>
–intent-to-add</p>
<blockquote>
<p>When applying the patch only to the working tree, mark new files to be
added to the index later (see <strong>–intent-to-add</strong> option in <strong>git-add*(1)).
This option is ignored unless running in a Git repository and *–index</strong>
is not specified. Note that <strong>–index</strong> could be implied by other options
such as <strong>–cached</strong> or <strong>–3way</strong>.</p>
</blockquote>
<p>
-3, –3way</p>
<blockquote>
<p>Attempt 3-way merge if the patch records the identity of blobs it is
supposed to apply to and we have those blobs available locally, possibly
leaving the conflict markers in the files in the working tree for the
user to resolve. This option implies the <strong>–index</strong> option unless the
<strong>–cached</strong> option is used, and is incompatible with the <strong>–reject</strong>
option. When used with the <strong>–cached</strong> option, any conflicts are left at
higher stages in the cache.</p>
</blockquote>
<p>
–build-fake-ancestor=&lt;file&gt;</p>
<blockquote>
<p>Newer <em>git diff</em> output has embedded <em>index information</em> for each blob
to help identify the original version that the patch applies to. When
this flag is given, and if the original versions of the blobs are
available locally, builds a temporary index containing those blobs.</p>
<p>
When a pure mode change is encountered (which has no index information),
the information is read from the current index instead.</p>
</blockquote>
<p>
-R, –reverse</p>
<blockquote>
<p>Apply the patch in reverse.</p>
</blockquote>
<p>
–reject</p>
<blockquote>
<p>For atomicity, <em>git apply</em> by default fails the whole patch and does not
touch the working tree when some of the hunks do not apply. This option
makes it apply the parts of the patch that are applicable, and leave the
rejected hunks in corresponding *.rej files.</p>
</blockquote>
<p>
-z</p>
<blockquote>
<p>When <strong>–numstat</strong> has been given, do not munge pathnames, but use a
NUL-terminated machine-readable format.</p>
<p>
Without this option, pathnames with &#34;unusual&#34; characters are quoted as
explained for the configuration variable <strong>core.quotePath</strong> (see
*git-config*(1)).</p>
</blockquote>
<p>
-p&lt;n&gt;</p>
<blockquote>
<p>Remove &lt;n&gt; leading path components (separated by slashes) from
traditional diff paths. E.g., with <strong>-p2</strong>, a patch against <strong>a/dir/file</strong>
will be applied directly to <strong>file</strong>. The default is 1.</p>
</blockquote>
<p>
-C&lt;n&gt;</p>
<blockquote>
<p>Ensure at least &lt;n&gt; lines of surrounding context match before and after
each change. When fewer lines of surrounding context exist they all must
match. By default no context is ever ignored.</p>
</blockquote>
<p>
–unidiff-zero</p>
<blockquote>
<p>By default, <em>git apply</em> expects that the patch being applied is a
unified diff with at least one line of context. This provides good
safety measures, but breaks down when applying a diff generated with
<strong>–unified=0</strong>. To bypass these checks use <strong>–unidiff-zero</strong>.</p>
<p>
Note, for the reasons stated above, the usage of context-free patches is
discouraged.</p>
</blockquote>
<p>
–apply</p>
<blockquote>
<p>If you use any of the options marked &#34;Turns off <em>apply</em>&#34; above, <em>git
apply</em> reads and outputs the requested information without actually
applying the patch. Give this flag after those flags to also apply the
patch.</p>
</blockquote>
<p>
–no-add</p>
<blockquote>
<p>When applying a patch, ignore additions made by the patch. This can be
used to extract the common part between two files by first running
<em>diff</em> on them and applying the result with this option, which would
apply the deletion part but not the addition part.</p>
</blockquote>
<p>
–allow-binary-replacement, –binary</p>
<blockquote>
<p>Historically we did not allow binary patch application without an
explicit permission from the user, and this flag was the way to do so.
Currently, we always allow binary patch application, so this is a no-op.</p>
</blockquote>
<p>
–exclude=&lt;path-pattern&gt;</p>
<blockquote>
<p>Don&#39;t apply changes to files matching the given path pattern. This can
be useful when importing patchsets, where you want to exclude certain
files or directories.</p>
</blockquote>
<p>
–include=&lt;path-pattern&gt;</p>
<blockquote>
<p>Apply changes to files matching the given path pattern. This can be
useful when importing patchsets, where you want to include certain files
or directories.</p>
<p>
When <strong>–exclude</strong> and <strong>–include</strong> patterns are used, they are examined in
the order they appear on the command line, and the first match
determines if a patch to each path is used. A patch to a path that does
not match any include/exclude pattern is used by default if there is no
include pattern on the command line, and ignored if there is any include
pattern.</p>
</blockquote>
<p>
–ignore-space-change, –ignore-whitespace</p>
<blockquote>
<p>When applying a patch, ignore changes in whitespace in context lines if
necessary. Context lines will preserve their whitespace, and they will
not undergo whitespace fixing regardless of the value of the
<strong>–whitespace</strong> option. New lines will still be fixed, though.</p>
</blockquote>
<p>
–whitespace=&lt;action&gt;</p>
<blockquote>
<p>When applying a patch, detect a new or modified line that has whitespace
errors. What are considered whitespace errors is controlled by
<strong>core.whitespace</strong> configuration. By default, trailing whitespaces
(including lines that solely consist of whitespaces) and a space
character that is immediately followed by a tab character inside the
initial indent of the line are considered whitespace errors.</p>
<p>
By default, the command outputs warning messages but applies the patch.
When <strong>git-apply</strong> is used for statistics and not applying a patch, it
defaults to <strong>nowarn</strong>.</p>
<p>
You can use different <strong>&lt;action&gt;</strong> values to control this behavior:</p>
<blockquote>
<p>·</p>
<p>
<strong>nowarn</strong> turns off the trailing whitespace warning.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>warn</strong> outputs warnings for a few such errors, but applies the patch
as-is (default).</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>fix</strong> outputs warnings for a few such errors, and applies the patch
after fixing them (<strong>strip</strong> is a synonym — the tool used to consider
only trailing whitespace characters as errors, and the fix involved
<em>stripping</em> them, but modern Gits do more).</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>error</strong> outputs warnings for a few such errors, and refuses to apply the
patch.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>error-all</strong> is similar to <strong>error</strong> but shows all errors.</p>
</blockquote>
</blockquote>
<p>
–inaccurate-eof</p>
<blockquote>
<p>Under certain circumstances, some versions of <em>diff</em> do not correctly
detect a missing new-line at the end of the file. As a result, patches
created by such <em>diff</em> programs do not record incomplete lines
correctly. This option adds support for applying such patches by working
around this bug.</p>
</blockquote>
<p>
-v, –verbose</p>
<blockquote>
<p>Report progress to stderr. By default, only a message about the current
patch being applied will be printed. This option will cause additional
information to be reported.</p>
</blockquote>
<p>
-q, –quiet</p>
<blockquote>
<p>Suppress stderr output. Messages about patch status and progress will
not be printed.</p>
</blockquote>
<p>
–recount</p>
<blockquote>
<p>Do not trust the line counts in the hunk headers, but infer them by
inspecting the patch (e.g. after editing the patch without adjusting the
hunk headers appropriately).</p>
</blockquote>
<p>
–directory=&lt;root&gt;</p>
<blockquote>
<p>Prepend &lt;root&gt; to all filenames. If a &#34;-p&#34; argument was also passed, it
is applied before prepending the new root.</p>
<p>
For example, a patch that talks about updating <strong>a/git-gui.sh</strong> to
<strong>b/git-gui.sh</strong> can be applied to the file in the working tree
<strong>modules/git-gui/git-gui.sh</strong> by running <strong>git apply
–directory=modules/git-gui</strong>.</p>
</blockquote>
<p>
–unsafe-paths</p>
<blockquote>
<p>By default, a patch that affects outside the working area (either a Git
controlled working tree, or the current working directory when &#34;git
apply&#34; is used as a replacement of GNU patch) is rejected as a mistake
(or a mischief).</p>
<p>
When <strong>git apply</strong> is used as a &#34;better GNU patch&#34;, the user can pass the
<strong>–unsafe-paths</strong> option to override this safety check. This option has
no effect when <strong>–index</strong> or <strong>–cached</strong> is in use.</p>
</blockquote>
<p>
–allow-empty</p>
<blockquote>
<p>Don&#39;t return an error for patches containing no diff. This includes
empty patches and patches with commit text only.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
CONFIGURATION
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Everything below this line in this section is selectively included from
the *git-config*(1) documentation. The content is the same as what&#39;s
found there:</p>
<p>
apply.ignoreWhitespace</p>
<blockquote>
<p>When set to <em>change</em>, tells <em>git apply</em> to ignore changes in whitespace,
in the same way as the <strong>–ignore-space-change</strong> option. When set to one
of: no, none, never, false, it tells <em>git apply</em> to respect all
whitespace differences. See *git-apply*(1).</p>
</blockquote>
<p>
apply.whitespace</p>
<blockquote>
<p>Tells <em>git apply</em> how to handle whitespace, in the same way as the
<strong>–whitespace</strong> option. See *git-apply*(1).</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SUBMODULES
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>If the patch contains any changes to submodules then <em>git apply</em> treats
these changes as follows.</p>
<p>
If <strong>–index</strong> is specified (explicitly or implicitly), then the submodule
commits must match the index exactly for the patch to apply. If any of
the submodules are checked-out, then these check-outs are completely
ignored, i.e., they are not required to be up to date or clean and they
are not updated.</p>
<p>
If <strong>–index</strong> is not specified, then the submodule commits in the patch
are ignored and only the absence or presence of the corresponding
subdirectory is checked and (if possible) updated.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>*git-am*(1).</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
GIT
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
